app/Controllers/Siswa/Dashboard.php

    public function index()
    {
        $userId = session()->get('id');
        $siswaModel = new SiswaModel();

        // PERBAIKAN 1: Join ke tabel users untuk mendapatkan nama_lengkap & foto
        $siswa = $siswaModel->select('siswa.*, users.nama_lengkap, users.foto')
                            ->join('users', 'users.id = siswa.user_id')
                            ->where('siswa.user_id', $userId)
                            ->first();
---
SELECT `siswa`.*, `users`.`nama_lengkap`, `users`.`foto`, `kelas`.`pesan_motivasi`, `kelas`.`nama_kelas`
FROM `siswa`
JOIN `users` ON `users`.`id` = `siswa`.`user_id`
LEFT JOIN `kelas` ON `kelas`.`id` = `siswa`.`kelas_id`
WHERE `siswa`.`user_id` = '3'
 LIMIT 1

        }

        // PERBAIKAN 2: Join ke tabel kelas untuk mendapatkan nama_kelas pada Top Siswa Sekolah
        $allSiswa = $siswaModel->select('siswa.*, users.nama_lengkap, users.foto, kelas.nama_kelas')
                              ->join('users', 'users.id = siswa.user_id')
                              ->join('kelas', 'kelas.id = siswa.kelas_id', 'left')
                              ->orderBy('total_poin', 'DESC')
                              ->findAll();
---
SELECT `siswa`.*, `users`.`nama_lengkap`, `users`.`foto`, `kelas`.`nama_kelas`
FROM `siswa`
JOIN `users` ON `users`.`id` = `siswa`.`user_id`
LEFT JOIN `kelas` ON `kelas`.`id` = `siswa`.`kelas_id`
ORDER BY `total_poin` DESC