app/Controllers/Admin/Dashboard.php

SELECT *
FROM `sekolah`
 LIMIT 1
SELECT COUNT(*) AS `numrows` FROM `guru`
SELECT COUNT(*) AS `numrows` FROM `siswa`
SELECT COUNT(*) AS `numrows` FROM `kelas`
---
    public function index()
    {
        $sekolahModel = new SekolahModel();
        $guruModel = new GuruModel();
        $siswaModel = new SiswaModel();
        $kelasModel = new KelasModel();

        $data = [
            'title'       => 'Dashboard Admin',
            'sekolah'     => $sekolahModel->first(),
            'total_guru'  => $guruModel->countAll(),
            'total_siswa' => $siswaModel->countAll(),
            'total_kelas' => $kelasModel->countAll(),