app/Controllers/Admin/Kelas.php

    public function index()
    {
        $data = [
            'title' => 'Data Kelas',
            'kelas' => $this->kelasModel->select('kelas.*, users.nama_lengkap as nama_walas')
                                      ->join('guru', 'guru.id = kelas.wali_kelas_id', 'left')
                                      ->join('users', 'users.id = guru.user_id', 'left')
                                      ->findAll()
---
SELECT `kelas`.*, `users`.`nama_lengkap` as `nama_walas`
FROM `kelas`
LEFT JOIN `guru` ON `guru`.`id` = `kelas`.`wali_kelas_id`
LEFT JOIN `users` ON `users`.`id` = `guru`.`user_id`

    public function update($id)
    {
        $kelasLama = $this->kelasModel->find($id);
        if ($kelasLama['nama_kelas'] == $this->request->getVar('nama_kelas')) {
            $rule_nama = 'required';
        } else {
            $rule_nama = 'required|is_unique[kelas.nama_kelas]';
        }

        if (!$this->validate([
            'nama_kelas' => $rule_nama
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->kelasModel->update($id, [
            'nama_kelas' => $this->request->getVar('nama_kelas'),
            'wali_kelas_id' => $this->request->getVar('wali_kelas_id') ?: null
        ]);
---
SELECT *
FROM `kelas`
WHERE `kelas`.`id` = '2'
UPDATE `kelas` SET `nama_kelas` = 'X IPA 1', `wali_kelas_id` = '2', `updated_at` = '2026-01-20 13:25:51'
WHERE `kelas`.`id` IN ('2')