app/Controllers/Admin/Laporan.php

SELECT *
FROM `kelas`
---

        $data = [
            'title'    => 'Laporan Kegiatan Siswa',
            'kelas'    => $this->kelasModel->findAll(),

SELECT `siswa`.*, `users`.`nama_lengkap`, `users`.`username`, `users`.`foto`, `users`.`role`, `kelas`.`nama_kelas`
FROM `siswa`
JOIN `users` ON `users`.`id` = `siswa`.`user_id`
LEFT JOIN `kelas` ON `kelas`.`id` = `siswa`.`kelas_id`
ORDER BY `siswa`.`total_poin` DESC
SELECT *
FROM `kelas`
---
    public function ranking()
    {
        $kelasId = $this->request->getVar('kelas');

        $ranking = [];
        if ($kelasId) {
            $ranking = $this->siswaModel->getSiswaByKelas($kelasId);
        } else {
            $this->siswaModel->select('siswa.*, users.nama_lengkap, users.username, users.foto, users.role, kelas.nama_kelas');
            $this->siswaModel->join('users', 'users.id = siswa.user_id');
            $this->siswaModel->join('kelas', 'kelas.id = siswa.kelas_id', 'left');
            $this->siswaModel->orderBy('siswa.total_poin', 'DESC');
            $ranking = $this->siswaModel->findAll();
        }

        $data = [
            'title'          => 'Laporan Ranking Siswa',
            'kelas'          => $this->kelasModel->findAll(),