app/Controllers/Admin/Profile.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function index()
    {
        $userModel = new UserModel();
        $id = session()->get('id');
        $data = [
            'title' => 'Edit Profil',
            'user'  => $userModel->find($id)