app/Controllers/Admin/Siswa.php

SELECT *
FROM `users`
WHERE `username` = 'siswa2'
 LIMIT 1
SELECT *
FROM `kelas`
WHERE `nama_kelas` = 'X TKJ 1'
 LIMIT 1
---
    public function import()
    {
        $file = $this->request->getFile('file_excel');

        if ($file) {
            $spreadsheet = IOFactory::load($file);
            $sheet = $spreadsheet->getActiveSheet();
            $rows = $sheet->toArray();

            foreach ($rows as $key => $row) {
                if ($key == 0) continue;

                $nisn = $row[0];
                $nama = $row[1];
                $username = $row[2];
                $password = $row[3];
                $namaKelas = $row[4];

                if ($nama && $username && $password && $namaKelas) {
                    $exists = $this->userModel->where('username', $username)->first();
                    if (!$exists) {
                        $kelas = $this->kelasModel->where('nama_kelas', $namaKelas)->first();

INSERT INTO `siswa` (`user_id`, `nisn`, `kelas_id`, `total_poin`) VALUES (5, '12365128', '1', 0)
---
                            ]);
                            $userId = $this->userModel->getInsertID();

                            $this->siswaModel->save([
                                'user_id'  => $userId,
                                'nisn'     => $nisn,
                                'kelas_id' => $kelas['id'],
                                'total_poin' => 0
                            ]);