app/Controllers/Walas/Kegiatan.php

SELECT *
FROM `guru`
WHERE `user_id` = '2'
 LIMIT 1
---
    private function getGuruId()
    {
        $userId = session()->get('id');
        $guru = $this->guruModel->where('user_id', $userId)->first();

INSERT INTO `kegiatan` (`wali_kelas_id`, `judul`, `instruksi`, `tanggal_dibuat`) VALUES ('1', 'Sholat Zuhur Berjamaah', 'Melakukan Sholat Zuhur', '2026-01-20 13:57:17')
---
    public function store()
    {
        $guruId = $this->getGuruId();

        if (!$this->validate([
            'judul'       => 'required',
            'instruksi'   => 'required',
            'deskripsi.*' => 'required',
            'poin.*'      => 'required|numeric'
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->kegiatanModel->save([
            'wali_kelas_id' => $guruId,
            'judul'         => $this->request->getPost('judul'),
            'instruksi'     => $this->request->getPost('instruksi'),
            'tanggal_dibuat'=> date('Y-m-d H:i:s')
        ]);