app/Controllers/Walas/Laporan.php

SELECT *
FROM `guru`
WHERE `user_id` = '2'
 LIMIT 1
SELECT *
FROM `kelas`
WHERE `wali_kelas_id` = '1'
 LIMIT 1
---
    private function getKelasId()
    {
        $userId = session()->get('id');
        $guru = $this->guruModel->where('user_id', $userId)->first();
        if ($guru) {
            $kelas = $this->kelasModel->where('wali_kelas_id', $guru['id'])->first();