app/Models/KegiatanModel.php

    public function getKegiatanByWalas($waliKelasId)
    {
        return $this->where('wali_kelas_id', $waliKelasId)
                    ->orderBy('tanggal_dibuat', 'DESC')
                    ->findAll();
---
SELECT *
FROM `kegiatan`
WHERE `wali_kelas_id` = '1'
ORDER BY `tanggal_dibuat` DESC